Documents/ЭКО_ОперацииСКонтейнерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЭКО_ОперацииСКонтейнерами</Name>
			<BasedOn>
				<xr:Item>Document.ТребованиеНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСРаздельныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭКО_ВидОперацийСКонтейнерами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контейнеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭКО_Контейнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭКО_Площадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадкаДляПеремещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭКО_Площадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЭКО_ВидОперацийСКонтейнерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ЭКО_ВидОперацийСКонтейнерами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выдача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаБУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭКО_Контейнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ЭКО_Контейнеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЭКО_ОперацииСКонтейнерами/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СгенерироватьКонтейнерыНаСервере()
	Для Каждого Эл из Объект.Контейнеры Цикл 
		//Если ЗначениеЗаполнено(Эл.ИнвентарныйНомер) и ЗначениеЗаполнено(Эл.ПервоначальнаяСтоимость) и Не ЗначениеЗаполнено(Эл.Контейнер)   Тогда 
		Если ЗначениеЗаполнено(Эл.ПервоначальнаяСтоимость) и Не ЗначениеЗаполнено(Эл.Контейнер)   Тогда 
			
						
			Конт = Справочники.ЭКО_Контейнеры.СоздатьЭлемент();
			
			Если не ЗначениеЗаполнено( Эл.Номенклатура.Эко_ТипТары) Тогда 
				Сообщить("Для номенклатуры в строке " + эл.номерСТроки + " не заполнен тип тары!", СтатусСообщения.Важное);
			Продолжить;
			Иначе 
				Конт.СрокПолезногоИспользования = Эл.Номенклатура.Эко_ТипТары.СрокПолезногоИспользования;
			КонецЕсли;

			Если ЗначениеЗаполнено(Эл.ИнвентарныйНомер) Тогда
				Конт.ИнвентарныйНомер = Эл.ИнвентарныйНомер;
			КонецЕсли;
			
			//Конт.ИнвентарныйНомер = Эл.ИнвентарныйНомер;
			Конт.Наименование = Эл.Номенклатура.Наименование;
			Конт.ПервоначальнаяСтоимость = Эл.ПервоначальнаяСтоимость;
			Конт.ДатаВыдачи = Эл.ДатаВыдачи;
			Конт.Номенклатура = Эл.Номенклатура;
			
			
			Попытка
				Конт.Записать();
				//Если НЕ ЗначениеЗаполнено(Конт.ИнвентарныйНомер) Тогда
				//Конт.ИнвентарныйНомер = Конт.Код;
				//Конт.Записать();				
				//КонецЕсли;
				Сообщить("Создан контейнер " + Конт);
				Эл.Контейнер = Конт.Ссылка;
				Эл.ИнвентарныйНомер = Конт.ИнвентарныйНомер;
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		//Иначе 
		//	Сообщить("" + Эл.НомерСтроки + ": Не заполнен интвентарный номер или стоимость" );
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьКонтейнеры(Команда)
	СгенерироватьКонтейнерыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыНоменклатураПриИзменении(Элемент)
	ТС = Элементы.Контейнеры.ТекущиеДанные;
	Если ЗначениеЗаполнено(тс.Контейнер) Тогда 
	ТС.ИнвентарныйНомер = ВернутьИнвНом(тс.Контейнер);
	ТС.ПервоначальнаяСтоимость = ВернутьПервСт(тс.Контейнер);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция   ВернутьИнвНом(Контейнер)
	Возврат Контейнер.ИнвентарныйНомер;
КонецФункции

&НаСервере
Функция   ВернутьПервСт(Контейнер)
	Возврат Контейнер.ПервоначальнаяСтоимость;
КонецФункции



&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
	
&НаСервере
Процедура  УстановитьВидимость()
	Если  Объект.ВидОперации = Перечисления.ЭКО_ВидОперацийСКонтейнерами.Перемещение Тогда 
		Элементы.КонтейнерыПлощадкаДляПеремещения.Видимость = истина;
	Иначе 
		Элементы.КонтейнерыПлощадкаДляПеремещения.Видимость = ложь;
	КонецЕсли;
	
	Если  Объект.ВидОперации = Перечисления.ЭКО_ВидОперацийСКонтейнерами.Выдача Тогда 
		Элементы.КонтейнерыДатаВыдачи.Видимость = истина;
	Иначе 
		Элементы.КонтейнерыДатаВыдачи.Видимость = ложь;
	КонецЕсли;

	
	Если  Объект.ВидОперации = Перечисления.ЭКО_ВидОперацийСКонтейнерами.Выдача или 
		Объект.ВидОперации = Перечисления.ЭКО_ВидОперацийСКонтейнерами.Реализация 
	Тогда 
			Элементы.КонтейнерыНоменклатура.Видимость = истина;
	Иначе 
			Элементы.КонтейнерыНоменклатура.Видимость = ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьВидимость();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
          ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
